### **Ejercicio 1: Limpiar y transformar columnas de texto**
Dado el siguiente DataFrame de productos:

In [114]:
import pandas as pd

data = {
    'Producto': ['Café', 'té', ' chocolate', ' Cacao '],
    'Precio': [100, 80, 150, 120],
    'Categoría': ['bebidas calientes', 'bebidas calientes', 'snacks dulces', ' bebidas calientes ']
}

df_productos = pd.DataFrame(data)
print(df_productos)

     Producto  Precio            Categoría
0        Café     100    bebidas calientes
1          té      80    bebidas calientes
2   chocolate     150        snacks dulces
3      Cacao      120   bebidas calientes

In [115]:
df_productos['Producto'] = df_productos['Producto'].str.replace(" ","")

In [116]:
df_productos

    Producto  Precio            Categoría
0       Café     100    bebidas calientes
1         té      80    bebidas calientes
2  chocolate     150        snacks dulces
3      Cacao     120   bebidas calientes

In [117]:
#Convierte todos los valores de la columna Categoría a mayúsculas.
df_productos['Categoría'] = df_productos['Categoría'].str.upper()
df_productos

    Producto  Precio            Categoría
0       Café     100    BEBIDAS CALIENTES
1         té      80    BEBIDAS CALIENTES
2  chocolate     150        SNACKS DULCES
3      Cacao     120   BEBIDAS CALIENTES

In [118]:
#Reemplaza la categoría 'snacks dulces' por 'postres'.
df_productos.at[2, 'Categoría'] = 'postres'
df_productos

    Producto  Precio            Categoría
0       Café     100    BEBIDAS CALIENTES
1         té      80    BEBIDAS CALIENTES
2  chocolate     150              postres
3      Cacao     120   BEBIDAS CALIENTES

In [119]:
#Crea una nueva columna que indique si el precio es mayor o igual a 120.
df_productos['montoprecio'] = df_productos['Precio'].apply(lambda x: True if x >= 120 else False)
df_productos

    Producto  Precio            Categoría  montoprecio
0       Café     100    BEBIDAS CALIENTES        False
1         té      80    BEBIDAS CALIENTES        False
2  chocolate     150              postres         True
3      Cacao     120   BEBIDAS CALIENTES          True

### **Ejercicio 2: Limpieza de duplicados y manejo de datos faltantes**
Dado el siguiente DataFrame de empleados:

In [120]:
data_empleados = {
    'Nombre': ['Ana', 'Luis', 'Pedro', 'Luis', 'Juan', 'Ana'],
    'Edad': [29, 45, None, 40, 35, 29],
    'Departamento': ['Ventas', 'Finanzas', 'RRHH', None, 'Marketing', None]
}

df_empleados = pd.DataFrame(data_empleados)
data_empleados

{'Nombre': ['Ana', 'Luis', 'Pedro', 'Luis', 'Juan', 'Ana'],
 'Edad': [29, 45, None, 40, 35, 29],
 'Departamento': ['Ventas', 'Finanzas', 'RRHH', None, 'Marketing', None]}

In [121]:
#Eliminar duplicados.
df_empleados = df_empleados.sort_values(by='Edad')
df_empleados = df_empleados.drop_duplicates(subset='Nombre')
df_empleados

  Nombre  Edad Departamento
0    Ana  29.0       Ventas
4   Juan  35.0    Marketing
3   Luis  40.0         None
2  Pedro   NaN         RRHH

In [122]:
# persona más joven
df_empleados = df_empleados.sort_values(by='Edad').copy()
print(df_empleados.loc[0])

Nombre             Ana
Edad              29.0
Departamento    Ventas
Name: 0, dtype: object

In [123]:
df_empleados

  Nombre  Edad Departamento
0    Ana  29.0       Ventas
4   Juan  35.0    Marketing
3   Luis  40.0         None
2  Pedro   NaN         RRHH

In [124]:
2. #Llena los valores faltantes de la columna Edad con la media de las edades
edad_media= df_empleados['Edad'].mean()
df_empleados['Edad'] = df_empleados['Edad'].fillna(edad_media)

In [125]:
df_empleados

  Nombre       Edad Departamento
0    Ana  29.000000       Ventas
4   Juan  35.000000    Marketing
3   Luis  40.000000         None
2  Pedro  34.666667         RRHH

In [126]:
# Llena los valores faltantes de la columna Departamento con el valor 'Desconocido'.

df_empleados['Departamento'].fillna("Desconocido")

0         Ventas
4      Marketing
3    Desconocido
2           RRHH
Name: Departamento, dtype: object

In [131]:
# Ordena el DataFrame por edad de forma descendente.
df_empleados = df_empleados.sort_values(by='Edad',ascending=False)

print(df_empleados)

  Nombre       Edad Departamento
3   Luis  40.000000         None
4   Juan  35.000000    Marketing
2  Pedro  34.666667         RRHH
0    Ana  29.000000       Ventas

### **Ejercicio 3: Aplicar funciones a las columnas**
Dado un DataFrame de ventas de productos:

In [133]:
data_ventas = {
    'Producto': ['Café', 'Té', 'Jugo', 'Agua'],
    'Precio': [120, 80, 90, 60],
    'Cantidad': [3, 5, 2, 8]
}

df_ventas = pd.DataFrame(data_ventas)

In [137]:
df_ventas['totalventas']=df_ventas['Precio'] * df_ventas['Cantidad']
df_ventas

  Producto  Precio  Cantidad  totalventas
0     Café     120         3          360
1       Té      80         5          400
2     Jugo      90         2          180
3     Agua      60         8          480

1. Calcula el total de ventas (Precio * Cantidad) y agrégalo como una nueva columna.
2. Crea una nueva columna llamada **Descuento** que aplique un descuento del 10% si el precio es mayor a 100, y del 5% si es menor o igual a 100. Usa la función `apply` y una función `lambda`.

In [143]:
df_ventas['descuento'] = df_ventas['Precio'].apply(lambda x : x * 0.9 if x > 100 else x * 0.95)
df_ventas

  Producto  Precio  Cantidad  totalventas  descuento
0     Café     120         3          360      108.0
1       Té      80         5          400       76.0
2     Jugo      90         2          180       85.5
3     Agua      60         8          480       57.0

### **Ejercicio 4: Uso de funciones de cadena**
Dado el siguiente DataFrame de direcciones de clientes:

In [128]:
data_clientes = {
    'Cliente': ['Juan Pérez', 'Ana Ruiz', 'Pedro López'],
    'Dirección': ['calle falsa 123', 'Calle PRINCIPAL 45', 'AV. LOS robles 34']
}

df_clientes = pd.DataFrame(data_clientes)

1. Convierte todos los valores de la columna **Dirección** a minúsculas.
2. Reemplaza las abreviaturas "calle", "av." por "calle" y "avenida" respectivamente.
3. Extrae el número de la dirección y guárdalo en una nueva columna llamada **Número**.

In [144]:
df_clientes['Dirección'] = df_clientes['Dirección'].str.lower()
df_clientes

       Cliente           Dirección
0   Juan Pérez     calle falsa 123
1     Ana Ruiz  calle principal 45
2  Pedro López   av. los robles 34

In [145]:
df_clientes['Dirección'] = df_clientes['Dirección'].str.replace('av.', 'avenida')
df_clientes

       Cliente              Dirección
0   Juan Pérez        calle falsa 123
1     Ana Ruiz     calle principal 45
2  Pedro López  avenida los robles 34

In [146]:
df_clientes['Número'] = df_clientes['Dirección'].str.extract(r'(\d+)$')
df_clientes

       Cliente              Dirección Número
0   Juan Pérez        calle falsa 123    123
1     Ana Ruiz     calle principal 45     45
2  Pedro López  avenida los robles 34     34